; domain
(define (domain cell-assembly)
  (:requirements :strips :typing
		 :negative-preconditions
		 :action-costs)
  (:types arm		       ;
	  position	       ; Where the arms is potentially able to go
	  holdable
	  job - object
	  
	  table - position     ; The place to attach components with arms.
	  container - position ; Has infinite capacity to store things.
	  
	  conveyor - container ; Slide things in/away. Infinite length.
	  tray - container     ; Part trays.
	  
	  machine - table      ; Tables which does specific jobs by itself.
	  machine-job - job    ; Jobs which should be done on machines.
	  base - holdable      ;
	  component - holdable ; Things which should be attatched on tables.
	  )
  (:constants carry-in - conveyor  ; the start of the base
	      carry-out - conveyor ; the goal of the base
	      table-in - table	   ; always connected to the conveyor
	      table-out - table	   ; always connected to the conveyor
	      nothing-done - job)  ; general start state of any base
  (:predicates 

   ;; arm attributes
   (reachable ?arm - arm ?to - position)
   ;; position attributes
   (connected ?from ?to - position) ;; by conveyor
   ;; job attributes
   (depends ?prev-job ?job - job)
   (job-available-at ?job - job ?pos - table)
   (uses ?job - job ?component - component)
   
   ;; state description
   (at ?obj - object ?pos - position)
   (arm-present ?pos - position)
   (base-present ?pos - position)
   
   (hold ?arm - arm ?holdable - holdable)
   (free ?arm - arm) ;; instead of (not (exists (?base) (hold ?arm ?base)))

   ;; (used ?component - component)
   
   (finished ?job - job ?base - base))

  (:functions
   (total-cost)
   (loading-cost)        ; the cost to set and eject base
   (job-cost ?job - job) ; the cost to do each job
   
   ;; slidng bases costs nothing

   (move-cost ?from ?to - position) - number)

  (:action move-arm
	   ;;   Moves the arm (?arm) from the source
	   ;; (?from) to the destination (?to). The occupied and not-
	   ;; occupied propositions enforce a mutual exclusion con-
	   ;; straint so that only one arm can occupy any given location
	   ;; at a time.
	   :parameters (?arm - arm ?from - position ?to - position)
	   :precondition (and (at ?arm ?from)
			      (not (arm-present ?to))
			      (free ?arm)
			      (reachable ?arm ?to))
	   :effect (and (at ?arm ?to)
			(arm-present ?to)
			(not (at ?arm ?from))
			(not (arm-present ?from))
			(increase (total-cost) (move-cost ?from ?to))))

  (:action move-arm-holding
	   ;;   Moves the arm (?arm) from the source
	   ;; (?from) to the destination (?to). The occupied and not-
	   ;; occupied propositions enforce a mutual exclusion con-
	   ;; straint so that only one arm can occupy any given location
	   ;; at a time.
	   :parameters (?arm - arm
		        ?from - position ?to - position
			?thing - holdable)
	   :precondition (and (at ?arm ?from)
			      (not (arm-present ?to))
			      (hold ?arm ?thing)
			      (reachable ?arm ?to))
	   :effect (and (at ?arm ?to)
			(arm-present ?to)
			(not (at ?arm ?from))
			(not (arm-present ?from))
			(increase (total-cost) (move-cost ?from ?to))))
  
  (:action eject-base
	   ;; Eject Base: Uses an arm (?arm) to grasp and pick up a
	   ;; base (?base) from a machine or a table (?pos). Resets
	   ;; the mutual exclusion constraint enforcing the rule that
	   ;; at most 1 base can be at a location (notbaseplaced ?pos)
	   :parameters (?base - base ?arm - arm ?pos - table)
	   :precondition (and (at ?base ?pos)
			      (at ?arm ?pos)
			      (free ?arm))
	   :effect (and (hold ?arm ?base)
			(not (free ?arm))
			(not (base-present ?pos))
			(not (at ?base ?pos))
			(increase (total-cost) (loading-cost))))
  
  (:action set-base
	   ;; Set Base: Commands an arm (?arm) that is holding
	   ;; a particular base (?base) to set the base on a machine
	   ;; or table (?pos). Each machine/table has a mutual
	   ;; exclusion constraint ensuring at most 1 base is placed
	   ;; on it (notbaseplaced).
	   :parameters (?base - base ?arm - arm ?pos - table)
	   :precondition (and (hold ?arm ?base)
			      (at ?arm ?pos)
			      (not (base-present ?pos)))
	   :effect (and (at ?base ?pos)
			(free ?arm)
			(not (hold ?arm ?base))
			(base-present ?pos)
			(increase (total-cost) (loading-cost))))

  (:action slide-base-in
	   ;; Slide Base: Uses a slide device to move a base. 
	   ;; MOD : CARRY-IN device only.
	   ;; MOD : It DOES care if the destination is already used.
	   :parameters (?base - base ?from - conveyor ?to - table)
	   :precondition (and (at ?base ?from)
			      (connected ?from ?to)
			      (not (base-present ?to)))
	   :effect (and (at ?base ?to)
			(not (at ?base ?from))
			(base-present ?to)
			(increase (total-cost) (loading-cost))))

  (:action slide-base-out
	   ;; Slide Base: Uses a slide device to move a base. 
	   ;; MOD : CARRY-OUT device only.
	   ;; MOD : It doesn't care if the destination is already used.
	   ;; MOD : After the action the base acts like it had disappeard.
	   :parameters (?base - base ?from - table ?to - conveyor)
	   :precondition (and (at ?base ?from)
			      (connected ?from ?to))
	   :effect (and (at ?base ?to)
			(not (at ?base ?from))
			(not (base-present ?from))
			(increase (total-cost) (loading-cost))))
  
  (:action pickup-component
	   ;; Pick Parts by Arm: Use an arm (?arm) to pick up a part
	   ;; (?part). The part will later be used by a BaseAssem-
	   ;; blePickedPartsXByArm action (see below).
	   ;; 
	   ;; NOTE: basically, we assume there are unlimited number of
	   ;; components in trays. That's why this action lacks the
	   ;; delete effect on the place of the component.
	   :parameters (?component - component ?arm - arm ?pos - tray)
	   :precondition (and (free ?arm)
			      (at ?arm ?pos)
			      (at ?component ?pos))
	   :effect (and (hold ?arm ?component)
			(not (free ?arm))
			(increase (total-cost) (loading-cost))))
  
  (:action assemble-with-machine
	   ;; Base Assemble by Machine: Use a machine (?pos) to
	   ;; perform an assembly operation (e.g., tighten the screw) on
	   ;; a base (?base).

	   ;; The ordering constraints which are determined when the
	   ;; object is designed are encoded as a set of ordering proposi-
	   ;; tions, finished_Step_X and unfihished_Step_X, which rep-
	   ;; resent whether an assembly step X has been performed
	   ;; already.
	   :parameters (?base - base
			?machine - machine
			?job - machine-job
			?prev-job - job)
	   :precondition (and ;; machine specification
			  (job-available-at ?job ?machine)
			  ;; state specification
			  (not (finished ?job ?base))
			  (at ?base ?machine)
			  ;; job dependency specification (linear)
			  (depends ?prev-job ?job)
			  (finished ?prev-job ?base))
	   :effect (and (finished ?job ?base)
			(increase (total-cost) (job-cost ?job))))

  (:action assemble-with-arm
	   ;; Base Assemble Picked Parts by Arm: Uses an arm
	   ;; (?arm) to attach a part (?part) to a base.
	   ;; 
	   ;; NOTE: components are not distinguished between each
	   ;;       other
	   :parameters (?component - component
			?job ?prev-job - job
			?base - base
			?arm - arm
			?pos - table)
	   :precondition (and
			  ;; job specification
			  (job-available-at ?job ?pos)
			  (uses ?job ?component)
			  ;; state specification
			  (hold ?arm ?component)
			  (at ?arm ?pos)
			  (at ?base ?pos)
			  ;; job dependency specification (linear)
			  (depends ?prev-job ?job)
			  (finished ?prev-job ?base))
	   :effect (and (finished ?job ?base)
			(free ?arm)
			(not (hold ?arm ?component))
			(increase (total-cost) (job-cost ?job)))))

; problem
(DEFINE (PROBLEM CELL-ASSEMBLY-MODEL3B-1) (:DOMAIN CELL-ASSEMBLY)
 (:OBJECTS A1 A2 A3 A4 - ARM B-0 - BASE P1 P2 P3 P4 - COMPONENT T1 T2 T3 T4 -
  TRAY TB12 TB23 TB34 - TABLE M1 M2 M3 M4 - MACHINE J1 - JOB J2 - MACHINE-JOB
  J3 - JOB J4 - MACHINE-JOB J5 - JOB J6 - MACHINE-JOB J7 - JOB J8 -
  MACHINE-JOB)
 (:INIT (= (TOTAL-COST) 0) (= (LOADING-COST) 1) (REACHABLE A1 TABLE-IN)
  (REACHABLE A1 T1) (REACHABLE A1 TB12) (REACHABLE A1 M1) (REACHABLE A2 TB12)
  (REACHABLE A2 T2) (REACHABLE A2 TB23) (REACHABLE A2 M2) (REACHABLE A3 TB23)
  (REACHABLE A3 TABLE-OUT) (REACHABLE A3 T3) (REACHABLE A3 TB34)
  (REACHABLE A3 M3) (REACHABLE A4 T4) (REACHABLE A4 TB34) (REACHABLE A4 M4)
  (= (MOVE-COST M1 M1) 1000) (= (MOVE-COST M1 T1) 2) (= (MOVE-COST M1 M2) 4)
  (= (MOVE-COST M1 T2) 4) (= (MOVE-COST M1 M3) 6) (= (MOVE-COST M1 T3) 7)
  (= (MOVE-COST M1 TABLE-OUT) 6) (= (MOVE-COST M1 M4) 8)
  (= (MOVE-COST M1 T4) 8) (= (MOVE-COST M1 TB34) 7) (= (MOVE-COST M1 TB23) 5)
  (= (MOVE-COST M1 TB12) 3) (= (MOVE-COST M1 TABLE-IN) 2)
  (= (MOVE-COST T1 M1) 2) (= (MOVE-COST T1 T1) 1000) (= (MOVE-COST T1 M2) 3)
  (= (MOVE-COST T1 T2) 3) (= (MOVE-COST T1 M3) 5) (= (MOVE-COST T1 T3) 6)
  (= (MOVE-COST T1 TABLE-OUT) 5) (= (MOVE-COST T1 M4) 7)
  (= (MOVE-COST T1 T4) 7) (= (MOVE-COST T1 TB34) 6) (= (MOVE-COST T1 TB23) 4)
  (= (MOVE-COST T1 TB12) 2) (= (MOVE-COST T1 TABLE-IN) 2)
  (= (MOVE-COST M2 M1) 4) (= (MOVE-COST M2 T1) 3) (= (MOVE-COST M2 M2) 1000)
  (= (MOVE-COST M2 T2) 2) (= (MOVE-COST M2 M3) 4) (= (MOVE-COST M2 T3) 5)
  (= (MOVE-COST M2 TABLE-OUT) 4) (= (MOVE-COST M2 M4) 6)
  (= (MOVE-COST M2 T4) 6) (= (MOVE-COST M2 TB34) 5) (= (MOVE-COST M2 TB23) 3)
  (= (MOVE-COST M2 TB12) 2) (= (MOVE-COST M2 TABLE-IN) 4)
  (= (MOVE-COST T2 M1) 4) (= (MOVE-COST T2 T1) 3) (= (MOVE-COST T2 M2) 2)
  (= (MOVE-COST T2 T2) 1000) (= (MOVE-COST T2 M3) 3) (= (MOVE-COST T2 T3) 4)
  (= (MOVE-COST T2 TABLE-OUT) 3) (= (MOVE-COST T2 M4) 5)
  (= (MOVE-COST T2 T4) 5) (= (MOVE-COST T2 TB34) 4) (= (MOVE-COST T2 TB23) 2)
  (= (MOVE-COST T2 TB12) 2) (= (MOVE-COST T2 TABLE-IN) 4)
  (= (MOVE-COST M3 M1) 6) (= (MOVE-COST M3 T1) 5) (= (MOVE-COST M3 M2) 4)
  (= (MOVE-COST M3 T2) 3) (= (MOVE-COST M3 M3) 1000) (= (MOVE-COST M3 T3) 2)
  (= (MOVE-COST M3 TABLE-OUT) 3) (= (MOVE-COST M3 M4) 5)
  (= (MOVE-COST M3 T4) 5) (= (MOVE-COST M3 TB34) 4) (= (MOVE-COST M3 TB23) 2)
  (= (MOVE-COST M3 TB12) 4) (= (MOVE-COST M3 TABLE-IN) 6)
  (= (MOVE-COST T3 M1) 7) (= (MOVE-COST T3 T1) 6) (= (MOVE-COST T3 M2) 5)
  (= (MOVE-COST T3 T2) 4) (= (MOVE-COST T3 M3) 2) (= (MOVE-COST T3 T3) 1000)
  (= (MOVE-COST T3 TABLE-OUT) 2) (= (MOVE-COST T3 M4) 4)
  (= (MOVE-COST T3 T4) 4) (= (MOVE-COST T3 TB34) 3) (= (MOVE-COST T3 TB23) 3)
  (= (MOVE-COST T3 TB12) 5) (= (MOVE-COST T3 TABLE-IN) 7)
  (= (MOVE-COST TABLE-OUT M1) 6) (= (MOVE-COST TABLE-OUT T1) 5)
  (= (MOVE-COST TABLE-OUT M2) 4) (= (MOVE-COST TABLE-OUT T2) 3)
  (= (MOVE-COST TABLE-OUT M3) 3) (= (MOVE-COST TABLE-OUT T3) 2)
  (= (MOVE-COST TABLE-OUT TABLE-OUT) 1000) (= (MOVE-COST TABLE-OUT M4) 3)
  (= (MOVE-COST TABLE-OUT T4) 3) (= (MOVE-COST TABLE-OUT TB34) 2)
  (= (MOVE-COST TABLE-OUT TB23) 2) (= (MOVE-COST TABLE-OUT TB12) 4)
  (= (MOVE-COST TABLE-OUT TABLE-IN) 6) (= (MOVE-COST M4 M1) 8)
  (= (MOVE-COST M4 T1) 7) (= (MOVE-COST M4 M2) 6) (= (MOVE-COST M4 T2) 5)
  (= (MOVE-COST M4 M3) 5) (= (MOVE-COST M4 T3) 4)
  (= (MOVE-COST M4 TABLE-OUT) 3) (= (MOVE-COST M4 M4) 1000)
  (= (MOVE-COST M4 T4) 2) (= (MOVE-COST M4 TB34) 2) (= (MOVE-COST M4 TB23) 4)
  (= (MOVE-COST M4 TB12) 6) (= (MOVE-COST M4 TABLE-IN) 8)
  (= (MOVE-COST T4 M1) 8) (= (MOVE-COST T4 T1) 7) (= (MOVE-COST T4 M2) 6)
  (= (MOVE-COST T4 T2) 5) (= (MOVE-COST T4 M3) 5) (= (MOVE-COST T4 T3) 4)
  (= (MOVE-COST T4 TABLE-OUT) 3) (= (MOVE-COST T4 M4) 2)
  (= (MOVE-COST T4 T4) 1000) (= (MOVE-COST T4 TB34) 2)
  (= (MOVE-COST T4 TB23) 4) (= (MOVE-COST T4 TB12) 6)
  (= (MOVE-COST T4 TABLE-IN) 8) (= (MOVE-COST TB34 M1) 7)
  (= (MOVE-COST TB34 T1) 6) (= (MOVE-COST TB34 M2) 5) (= (MOVE-COST TB34 T2) 4)
  (= (MOVE-COST TB34 M3) 4) (= (MOVE-COST TB34 T3) 3)
  (= (MOVE-COST TB34 TABLE-OUT) 2) (= (MOVE-COST TB34 M4) 2)
  (= (MOVE-COST TB34 T4) 2) (= (MOVE-COST TB34 TB34) 1000)
  (= (MOVE-COST TB34 TB23) 3) (= (MOVE-COST TB34 TB12) 5)
  (= (MOVE-COST TB34 TABLE-IN) 7) (= (MOVE-COST TB23 M1) 5)
  (= (MOVE-COST TB23 T1) 4) (= (MOVE-COST TB23 M2) 3) (= (MOVE-COST TB23 T2) 2)
  (= (MOVE-COST TB23 M3) 2) (= (MOVE-COST TB23 T3) 3)
  (= (MOVE-COST TB23 TABLE-OUT) 2) (= (MOVE-COST TB23 M4) 4)
  (= (MOVE-COST TB23 T4) 4) (= (MOVE-COST TB23 TB34) 3)
  (= (MOVE-COST TB23 TB23) 1000) (= (MOVE-COST TB23 TB12) 3)
  (= (MOVE-COST TB23 TABLE-IN) 5) (= (MOVE-COST TB12 M1) 3)
  (= (MOVE-COST TB12 T1) 2) (= (MOVE-COST TB12 M2) 2) (= (MOVE-COST TB12 T2) 2)
  (= (MOVE-COST TB12 M3) 4) (= (MOVE-COST TB12 T3) 5)
  (= (MOVE-COST TB12 TABLE-OUT) 4) (= (MOVE-COST TB12 M4) 6)
  (= (MOVE-COST TB12 T4) 6) (= (MOVE-COST TB12 TB34) 5)
  (= (MOVE-COST TB12 TB23) 3) (= (MOVE-COST TB12 TB12) 1000)
  (= (MOVE-COST TB12 TABLE-IN) 3) (= (MOVE-COST TABLE-IN M1) 2)
  (= (MOVE-COST TABLE-IN T1) 2) (= (MOVE-COST TABLE-IN M2) 4)
  (= (MOVE-COST TABLE-IN T2) 4) (= (MOVE-COST TABLE-IN M3) 6)
  (= (MOVE-COST TABLE-IN T3) 7) (= (MOVE-COST TABLE-IN TABLE-OUT) 6)
  (= (MOVE-COST TABLE-IN M4) 8) (= (MOVE-COST TABLE-IN T4) 8)
  (= (MOVE-COST TABLE-IN TB34) 7) (= (MOVE-COST TABLE-IN TB23) 5)
  (= (MOVE-COST TABLE-IN TB12) 3) (= (MOVE-COST TABLE-IN TABLE-IN) 1000)
  (CONNECTED CARRY-IN TABLE-IN) (CONNECTED TABLE-OUT CARRY-OUT)
  (= (JOB-COST J8) 3) (DEPENDS J7 J8) (JOB-AVAILABLE-AT J8 M4) (AT P4 T4)
  (USES J7 P4) (= (JOB-COST J7) 2) (DEPENDS J6 J7) (JOB-AVAILABLE-AT J7 TB34)
  (= (JOB-COST J6) 3) (DEPENDS J5 J6) (JOB-AVAILABLE-AT J6 M3) (AT P3 T3)
  (USES J5 P3) (= (JOB-COST J5) 3) (DEPENDS J4 J5) (JOB-AVAILABLE-AT J5 TB34)
  (= (JOB-COST J4) 2) (DEPENDS J3 J4) (JOB-AVAILABLE-AT J4 M2) (AT P2 T2)
  (USES J3 P2) (= (JOB-COST J3) 3) (DEPENDS J2 J3) (JOB-AVAILABLE-AT J3 TB23)
  (= (JOB-COST J2) 3) (DEPENDS J1 J2) (JOB-AVAILABLE-AT J2 M1) (AT P1 T1)
  (USES J1 P1) (= (JOB-COST J1) 3) (DEPENDS NOTHING-DONE J1)
  (JOB-AVAILABLE-AT J1 TB12) (= (JOB-COST NOTHING-DONE) 0) (AT B-0 CARRY-IN)
  (FINISHED NOTHING-DONE B-0) (FREE A1) (AT A1 TABLE-IN) (ARM-PRESENT TABLE-IN)
  (FREE A2) (AT A2 TB12) (ARM-PRESENT TB12) (FREE A3) (AT A3 TB23)
  (ARM-PRESENT TB23) (FREE A4) (AT A4 TB34) (ARM-PRESENT TB34))
 (:GOAL (AND (AT B-0 CARRY-OUT) (FINISHED J8 B-0)))
 (:METRIC MINIMIZE (TOTAL-COST)))

; plan
1. (slide-base-in b-0 carry-in table-in)
   deleted: (at b-0 carry-in)
   added: (at b-0 table-in) (base-present table-in)
   goals met: 0 of 2
2. (move-arm a2 tb12 t2)
   deleted: (at a2 tb12) (arm-present tb12)
   added: (at a2 t2) (arm-present t2)
   goals met: 0 of 2
3. (eject-base b-0 a1 table-in)
   deleted: (free a1) (base-present table-in) (at b-0 table-in)
   added: (hold a1 b-0)
   goals met: 0 of 2
4. (move-arm-holding a1 table-in tb12 b-0)
   deleted: (at a1 table-in) (arm-present table-in)
   added: (at a1 tb12) (arm-present tb12)
   goals met: 0 of 2
5. (set-base b-0 a1 tb12)
   deleted: (hold a1 b-0)
   added: (at b-0 tb12) (free a1) (base-present tb12)
   goals met: 0 of 2
6. (move-arm a1 tb12 t1)
   deleted: (at a1 tb12) (arm-present tb12)
   added: (at a1 t1) (arm-present t1)
   goals met: 0 of 2
7. (pickup-component p1 a1 t1)
   deleted: (free a1)
   added: (hold a1 p1)
   goals met: 0 of 2
8. (move-arm-holding a1 t1 tb12 p1)
   deleted: (at a1 t1) (arm-present t1)
   added: (at a1 tb12) (arm-present tb12)
   goals met: 0 of 2
9. (assemble-with-arm p1 j1 nothing-done b-0 a1 tb12)
   deleted: (hold a1 p1)
   added: (finished j1 b-0) (free a1)
   goals met: 0 of 2
10. (eject-base b-0 a1 tb12)
   deleted: (free a1) (base-present tb12) (at b-0 tb12)
   added: (hold a1 b-0)
   goals met: 0 of 2
11. (move-arm-holding a1 tb12 m1 b-0)
   deleted: (at a1 tb12) (arm-present tb12)
   added: (at a1 m1) (arm-present m1)
   goals met: 0 of 2
12. (set-base b-0 a1 m1)
   deleted: (hold a1 b-0)
   added: (at b-0 m1) (free a1) (base-present m1)
   goals met: 0 of 2
13. (assemble-with-machine b-0 m1 j2 j1)
   added: (finished j2 b-0)
   goals met: 0 of 2
14. (eject-base b-0 a1 m1)
   deleted: (free a1) (base-present m1) (at b-0 m1)
   added: (hold a1 b-0)
   goals met: 0 of 2
15. (move-arm-holding a1 m1 tb12 b-0)
   deleted: (at a1 m1) (arm-present m1)
   added: (at a1 tb12) (arm-present tb12)
   goals met: 0 of 2
16. (set-base b-0 a1 tb12)
   deleted: (hold a1 b-0)
   added: (at b-0 tb12) (free a1) (base-present tb12)
   goals met: 0 of 2
17. (move-arm a1 tb12 t1)
   deleted: (at a1 tb12) (arm-present tb12)
   added: (at a1 t1) (arm-present t1)
   goals met: 0 of 2
18. (move-arm a3 tb23 table-out)
   deleted: (at a3 tb23) (arm-present tb23)
   added: (at a3 table-out) (arm-present table-out)
   goals met: 0 of 2
19. (move-arm a2 t2 tb12)
   deleted: (at a2 t2) (arm-present t2)
   added: (at a2 tb12) (arm-present tb12)
   goals met: 0 of 2
20. (eject-base b-0 a2 tb12)
   deleted: (free a2) (base-present tb12) (at b-0 tb12)
   added: (hold a2 b-0)
   goals met: 0 of 2
21. (move-arm-holding a2 tb12 tb23 b-0)
   deleted: (at a2 tb12) (arm-present tb12)
   added: (at a2 tb23) (arm-present tb23)
   goals met: 0 of 2
22. (set-base b-0 a2 tb23)
   deleted: (hold a2 b-0)
   added: (at b-0 tb23) (free a2) (base-present tb23)
   goals met: 0 of 2
23. (move-arm a2 tb23 t2)
   deleted: (at a2 tb23) (arm-present tb23)
   added: (at a2 t2) (arm-present t2)
   goals met: 0 of 2
24. (pickup-component p2 a2 t2)
   deleted: (free a2)
   added: (hold a2 p2)
   goals met: 0 of 2
25. (move-arm-holding a2 t2 tb23 p2)
   deleted: (at a2 t2) (arm-present t2)
   added: (at a2 tb23) (arm-present tb23)
   goals met: 0 of 2
26. (assemble-with-arm p2 j3 j2 b-0 a2 tb23)
   deleted: (hold a2 p2)
   added: (finished j3 b-0) (free a2)
   goals met: 0 of 2
27. (eject-base b-0 a2 tb23)
   deleted: (free a2) (base-present tb23) (at b-0 tb23)
   added: (hold a2 b-0)
   goals met: 0 of 2
28. (move-arm-holding a2 tb23 m2 b-0)
   deleted: (at a2 tb23) (arm-present tb23)
   added: (at a2 m2) (arm-present m2)
   goals met: 0 of 2
29. (set-base b-0 a2 m2)
   deleted: (hold a2 b-0)
   added: (at b-0 m2) (free a2) (base-present m2)
   goals met: 0 of 2
30. (assemble-with-machine b-0 m2 j4 j3)
   added: (finished j4 b-0)
   goals met: 0 of 2
31. (eject-base b-0 a2 m2)
   deleted: (free a2) (base-present m2) (at b-0 m2)
   added: (hold a2 b-0)
   goals met: 0 of 2
32. (move-arm-holding a2 m2 tb23 b-0)
   deleted: (at a2 m2) (arm-present m2)
   added: (at a2 tb23) (arm-present tb23)
   goals met: 0 of 2
33. (set-base b-0 a2 tb23)
   deleted: (hold a2 b-0)
   added: (at b-0 tb23) (free a2) (base-present tb23)
   goals met: 0 of 2
34. (move-arm a2 tb23 t2)
   deleted: (at a2 tb23) (arm-present tb23)
   added: (at a2 t2) (arm-present t2)
   goals met: 0 of 2
35. (move-arm a4 tb34 t4)
   deleted: (at a4 tb34) (arm-present tb34)
   added: (at a4 t4) (arm-present t4)
   goals met: 0 of 2
36. (pickup-component p4 a4 t4)
   deleted: (free a4)
   added: (hold a4 p4)
   goals met: 0 of 2
37. (move-arm a3 table-out tb23)
   deleted: (at a3 table-out) (arm-present table-out)
   added: (at a3 tb23) (arm-present tb23)
   goals met: 0 of 2
38. (eject-base b-0 a3 tb23)
   deleted: (free a3) (base-present tb23) (at b-0 tb23)
   added: (hold a3 b-0)
   goals met: 0 of 2
39. (move-arm-holding a3 tb23 tb34 b-0)
   deleted: (at a3 tb23) (arm-present tb23)
   added: (at a3 tb34) (arm-present tb34)
   goals met: 0 of 2
40. (set-base b-0 a3 tb34)
   deleted: (hold a3 b-0)
   added: (at b-0 tb34) (free a3) (base-present tb34)
   goals met: 0 of 2
41. (move-arm a3 tb34 t3)
   deleted: (at a3 tb34) (arm-present tb34)
   added: (at a3 t3) (arm-present t3)
   goals met: 0 of 2
42. (pickup-component p3 a3 t3)
   deleted: (free a3)
   added: (hold a3 p3)
   goals met: 0 of 2
43. (move-arm-holding a3 t3 tb34 p3)
   deleted: (at a3 t3) (arm-present t3)
   added: (at a3 tb34) (arm-present tb34)
   goals met: 0 of 2
44. (assemble-with-arm p3 j5 j4 b-0 a3 tb34)
   deleted: (hold a3 p3)
   added: (finished j5 b-0) (free a3)
   goals met: 0 of 2
45. (eject-base b-0 a3 tb34)
   deleted: (free a3) (base-present tb34) (at b-0 tb34)
   added: (hold a3 b-0)
   goals met: 0 of 2
46. (move-arm-holding a3 tb34 m3 b-0)
   deleted: (at a3 tb34) (arm-present tb34)
   added: (at a3 m3) (arm-present m3)
   goals met: 0 of 2
47. (set-base b-0 a3 m3)
   deleted: (hold a3 b-0)
   added: (at b-0 m3) (free a3) (base-present m3)
   goals met: 0 of 2
48. (assemble-with-machine b-0 m3 j6 j5)
   added: (finished j6 b-0)
   goals met: 0 of 2
49. (eject-base b-0 a3 m3)
   deleted: (free a3) (base-present m3) (at b-0 m3)
   added: (hold a3 b-0)
   goals met: 0 of 2
50. (move-arm-holding a3 m3 tb34 b-0)
   deleted: (at a3 m3) (arm-present m3)
   added: (at a3 tb34) (arm-present tb34)
   goals met: 0 of 2
51. (set-base b-0 a3 tb34)
   deleted: (hold a3 b-0)
   added: (at b-0 tb34) (free a3) (base-present tb34)
   goals met: 0 of 2
52. (move-arm a3 tb34 table-out)
   deleted: (at a3 tb34) (arm-present tb34)
   added: (at a3 table-out) (arm-present table-out)
   goals met: 0 of 2
53. (move-arm-holding a4 t4 tb34 p4)
   deleted: (at a4 t4) (arm-present t4)
   added: (at a4 tb34) (arm-present tb34)
   goals met: 0 of 2
54. (assemble-with-arm p4 j7 j6 b-0 a4 tb34)
   deleted: (hold a4 p4)
   added: (finished j7 b-0) (free a4)
   goals met: 0 of 2
55. (eject-base b-0 a4 tb34)
   deleted: (free a4) (base-present tb34) (at b-0 tb34)
   added: (hold a4 b-0)
   goals met: 0 of 2
56. (move-arm-holding a4 tb34 m4 b-0)
   deleted: (at a4 tb34) (arm-present tb34)
   added: (at a4 m4) (arm-present m4)
   goals met: 0 of 2
57. (set-base b-0 a4 m4)
   deleted: (hold a4 b-0)
   added: (at b-0 m4) (free a4) (base-present m4)
   goals met: 0 of 2
58. (assemble-with-machine b-0 m4 j8 j7)
   added: (finished j8 b-0)
   goals met: 1 of 2
59. (eject-base b-0 a4 m4)
   deleted: (free a4) (base-present m4) (at b-0 m4)
   added: (hold a4 b-0)
   goals met: 1 of 2
60. (move-arm-holding a4 m4 tb34 b-0)
   deleted: (at a4 m4) (arm-present m4)
   added: (at a4 tb34) (arm-present tb34)
   goals met: 1 of 2
61. (set-base b-0 a4 tb34)
   deleted: (hold a4 b-0)
   added: (at b-0 tb34) (free a4) (base-present tb34)
   goals met: 1 of 2
62. (move-arm a4 tb34 m4)
   deleted: (at a4 tb34) (arm-present tb34)
   added: (at a4 m4) (arm-present m4)
   goals met: 1 of 2
63. (move-arm a3 table-out tb34)
   deleted: (at a3 table-out) (arm-present table-out)
   added: (at a3 tb34) (arm-present tb34)
   goals met: 1 of 2
64. (eject-base b-0 a3 tb34)
   deleted: (free a3) (base-present tb34) (at b-0 tb34)
   added: (hold a3 b-0)
   goals met: 1 of 2
65. (move-arm-holding a3 tb34 table-out b-0)
   deleted: (at a3 tb34) (arm-present tb34)
   added: (at a3 table-out) (arm-present table-out)
   goals met: 1 of 2
66. (set-base b-0 a3 table-out)
   deleted: (hold a3 b-0)
   added: (at b-0 table-out) (free a3) (base-present table-out)
   goals met: 1 of 2
67. (slide-base-out b-0 table-out carry-out)
   deleted: (at b-0 table-out) (base-present table-out)
   added: (at b-0 carry-out)
   goals met: 2 of 2
